using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Culinary_Assistant.Core.Base.Data
{
	public static class PieceWeightsData
	{
		public static Dictionary<string, double> PieceWeights = new()
            {
                { "помидоры", 150 },         
                { "огурцы", 100 },           
                { "морковь", 80 },           
                { "лук репчатый", 75 },      
                { "чеснок", 5 },             
                { "болгарский перец", 120 }, 
                { "картофель", 100 },        
                { "свекла", 150 },           
                { "редис", 10 },             
                { "баклажаны", 200 },        
                { "кабачки", 250 },          
                { "тыква", 1000 },           
                { "капуста белокочанная", 1000 }, 
                { "цветная капуста", 500 },  
                { "брокколи", 150 },         
                { "авокадо", 170 },          

                { "яблоки", 150 },           
                { "бананы", 120 },           
                { "апельсины", 130 },        
                { "груши", 140 },            
                { "персики", 100 },          
                { "сливы", 40 },             
                { "мандарины", 80 },         
                { "киви", 75 },              
                { "абрикосы", 30 },          
                { "лимоны", 100 },           
                { "манго", 200 },            
                { "инжир (свежий)", 40 },    
                { "хурма", 150 },            
                { "гранат", 250 },           
                { "ананас", 1000 },          
                { "арбуз", 4000 },           
                { "дыня", 1500 },            
                { "виноград", 5 },           
                { "клубника", 10 },          
                { "малина", 3 },             
                { "черника", 1 },            
                { "черешня", 8 },            
                { "вишня", 5 },              

                { "шампиньоны", 20 },        
                { "белые грибы", 30 },       
                { "лисички", 5 },            
                { "вешенки", 15 },           
                { "опята", 2 },              
                { "маслята", 25 },           
                { "рыжики", 20 },           
                { "подберезовики", 30 },     
                { "сыроежки", 20 },          
                { "грузди", 30 },            
                { "трюфели", 10 },           
                { "эноки", 5 },              

                { "яйцо куриное (1 шт, 50 г)", 50 },  
                { "яйцо перепелиное", 10 },           
                { "яйцо утиное", 70 },                
                { "яйцо индюшиное", 75 },             
                { "яйцо страуса (на 100 г)", 1300 }   
            };
	}
}
