using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Culinary_Assistant.Core.Base.Data
{
	public static class TableSpoonWeightsData
	{
		public static Dictionary<string, double> TableSpoonWeights = new()
{
    { "вода", 15 },
	{ "молоко (1.5%)", 15 },
	{ "молоко (2.5%)", 15 },
	{ "молоко (3.2%)", 15 },
	{ "кефир (1%)", 15 },
	{ "кефир (2.5%)", 15 },
	{ "сметана (10%)", 15 },
	{ "сметана (15%)", 15 },
	{ "сливки (10%)", 15 },
	{ "сливки (20%)", 15 },
	{ "растительное масло", 15 },
	{ "оливковое масло", 15 },
	{ "уксус столовый", 15 },
	{ "винный уксус", 15 },
	{ "бальзамический уксус", 15 },
	{ "ликёр", 15 },
	{ "сироп", 15 },

    { "соль", 21 },
	{ "сахар", 15 },
	{ "сахарная пудра", 12 },
	{ "мука пшеничная", 9 },
	{ "мука кукурузная", 9 },
	{ "какао-порошок", 9 },
	{ "кофе молотый", 6 },
	{ "кофе растворимый", 6 },
	{ "разрыхлитель", 15 },
	{ "сода", 15 },
	{ "крахмал", 9 },
	{ "желатин", 9 },
	{ "сухие дрожжи", 9 },

    { "чёрный перец молотый", 6 },
	{ "красный перец молотый", 6 },
	{ "корица молотая", 6 },
	{ "гвоздика молотая", 6 },
	{ "имбирь молотый", 6 },
	{ "куркума", 6 },
	{ "карри", 6 },
	{ "паприка", 6 },
	{ "кориандр молотый", 6 },
	{ "горчица сухая", 6 },
	{ "лавровый лист", 3 }, 
    { "различные травы сушёные", 3 },

    { "мёд", 21 },
	{ "варенье", 15 },
	{ "джем", 15 },
	{ "сгущённое молоко", 18 },
	{ "томатная паста", 15 },
	{ "горчица столовая", 15 },
	{ "майонез", 15 },
	{ "кетчуп", 15 },
	{ "соевый соус", 15 },
	{ "аджика", 15 }
};
	}
}
