using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Culinary_Assistant.Core.Base.Data
{
	public static class TeaSpoonWeightsData
	{
		public static Dictionary<string, double> TeaSpoonWeights = new()
{
    { "вода", 5 },
	{ "молоко (1.5%)", 5 },
	{ "молоко (2.5%)", 5 },
	{ "молоко (3.2%)", 5 },
	{ "кефир (1%)", 5 },
	{ "кефир (2.5%)", 5 },
	{ "сметана (10%)", 5 },
	{ "сметана (15%)", 5 },
	{ "сливки (10%)", 5 },
	{ "сливки (20%)", 5 },
	{ "растительное масло", 5 },
	{ "оливковое масло", 5 },
	{ "уксус столовый", 5 },
	{ "винный уксус", 5 },
	{ "бальзамический уксус", 5 },
	{ "ликёр", 5 },
	{ "сироп", 5 },

    { "соль", 7 },
	{ "сахар", 5 },
	{ "сахарная пудра", 4 },
	{ "мука пшеничная", 3 },
	{ "мука кукурузная", 3 },
	{ "какао-порошок", 3 },
	{ "кофе молотый", 2 },
	{ "кофе растворимый", 2 },
	{ "разрыхлитель", 5 },
	{ "сода", 5 },
	{ "крахмал", 3 },
	{ "желатин", 3 },
	{ "сухие дрожжи", 3 },

    { "чёрный перец молотый", 2 },
	{ "красный перец молотый", 2 },
	{ "корица молотая", 2 },
	{ "гвоздика молотая", 2 },
	{ "имбирь молотый", 2 },
	{ "куркума", 2 },
	{ "карри", 2 },
	{ "паприка", 2 },
	{ "кориандр молотый", 2 },
	{ "горчица сухая", 2 },
	{ "лавровый лист", 1 }, 
    { "различные травы сушёные", 1 },

    { "мёд", 7 },
	{ "варенье", 5 },
	{ "джем", 5 },
	{ "сгущённое молоко", 6 },
	{ "томатная паста", 5 },
	{ "горчица столовая", 5 },
	{ "майонез", 5 },
	{ "кетчуп", 5 },
	{ "соевый соус", 5 },
	{ "аджика", 5 }
};
	}
}
